PI = 3.141592653589793
DEG2RAD = PI / 180.0
RAD2DEG = 180.0 / PI

# 领航点拖曳速度(10hz)
Step = {
    "x": 0.01,
    "y": 0.01,
    "z": 0.05,
    "rz": 5.0,
}

# 位置容许误差
AllowedError = {
    "x": 0.02,
    "y": 0.02,
    "z": 0.02,
    "rz": 1.3,
}

# 相机坐标偏置(单位: m / deg)
FRONT_CAM_OFFSET = {
    "x": 107.6 / 1000.0,
    "y": 320.0 / 1000.0,
    "z": 65.0 / 1000.0,
    "rx": -90.0,
    "ry": 0.0,
    "rz": 0.0,
}

DOWN_CAM_OFFSET = {
    "x": 0.0,
    "y": 170.0 / 1000.0,
    "z": 42.7 / 1000.0,
    "rx": 0.0,
    "ry": 0.0,
    "rz": 0.0,
}
